[{"attributes":{},"body":"<h1 id=\"conceptos-generales\">Conceptos Generales</h1>\n<!-- \n<h2 id=\"grafos\">Grafos (redes)</h2>\n\n### Red de intervalos\n### Red de sonidos\n### Red de ritmos\n### Red de interacciones\n### Red de eventos\n\n## Cíclo Redes \n\napertura radical entendida como la posibilidad de interacción de cada una de estas piezas con otras de la misma serie (superposición, fragmentación, variación, etc.), redes (grafos) de distintos tipos, limitación radical de recursos, apertura a la interpretación y a la improvisación, no requerimiento del virutosismo técnico, cuestionamiento estético-ético de para quién se escriben estas piezas y para que situaciones se concibe su interpretación y escucha.\n -->\n<h2 id=\"escala-de-percepci-n-de-los-materiales\">Escala de percepción de los materiales</h2>\n<p>Nota: No escala en el sentido técnico musical (de una secuencia ordenada de tonos), sino escala en el sentido de una secuencia de cantidades e incluso tipos dde detalle en la observación de algo. Así como en un microscopio podemos ver algo a 10 veces o 100 veces su escala.</p>\n<p>Ver un material a distintas escalas significa preguntar: ¿qué es ese material cuando es el foco de atención, qué cuando es sólo parte del paisaje, o un mero detalle? ¿Qué tanto puede hacerse aparecer en él, qué tanto puede desaparecer? ¿Hay algún punto donde su apariencia pueda cambiar tanto que parezca irreconocible, a pesar de que lo que está ahí siempre estuvo ahí? Por ejemplo, como cuando pasamos de los átomos a las partículas subatómicas, o de estos a las moléculas o los organismos.</p>\n<p>Lo que implica esto sobre el concepto de <em>material</em> y la concepción de <em>un material</em> es interesante.  </p>\n<p>Desde el punto de vista tradicional podríamos decir esquemáticamente:\nUn material es un tema o un motivo. El tema puede variarse, adornarse, extenderse, aumentar o disminuir en duración, etc., y en todos estos casos preservar su identidad o su relación próxima con la identidad de donde deriva.  </p>\n<p>Así por ejemplo, un tema de fuga de Bach no varía más que en transposición, y en ciertos casos, en interválica, más el propósito de su ser tema (y su ser material) es ser lo más reconocible que se pueda.</p>\n<p>Otro ejemplo, un tema de sonata, está mucho más abierto a la variación e intervención con otros temas, pero igualmente su objetivo principal es ser reconocible.</p>\n<p>Con un motivo secundario, tenemos aun más libertad en cuanto a su variación y modificación, y decimos de su razón de ser que es la de dar coherencia. Pero el interés que despierta para desarrollar es menor en función de posición en la jerarquía de materiales de la obra.</p>\n<p>En todos estos casos excepto en el último, el concepto de escala de percepción. Hablar de escala en un tema prácticamente nos remite únicamente al tiempo, aumentación o disminución rítmica del mismo, o de su posición en la textura, ¿es voz principal (<em>hauptstimme</em>) o contrapunto?</p>\n<p>Acercarnos o alejarnos de un material, bajo este concepto de material no tiene sentido pues significa la destrucción de su identidad, y puesto que su ser material esta constituido sobre la base de la identidad, destruir su identidad significa destruir su materialidad.</p>\n<p>El concepto de material que me interesa y sobre el cuál he trabajado las obras presentadas aquí, es distinto en cuanto que sí permite la variación en la escala de percepción del material. Un material que en una aparición dura 8 segundos puede crecer y transformarse en un movimiento entero sin que sea necesario agregarle nada externo (cf. <a href=\"/5to-semestre/escalas-de-percepcion\">escala de percepción en &quot;Espíritu Penetrando en Árbol&quot;</a>).</p>\n<p><a href=\"/5to-semestre#escalas-de-percepcion-del-espiritu\"><img src=\"/public/images/epa/espiritu-mvt-1.png\" alt=\"Espíritu en el movimiento 1\">\n<img src=\"/public/images/epa/espiritu-mvt-2.png\" alt=\"Espíritu en el movimiento 2\"></a></p>\n<blockquote>\n<p>El material del &quot;Espíritu&quot; en dos escalas distintas, lejos y cerca, respectivamente</p>\n</blockquote>\n<p>El material en este caso no se concibe como un tema tradicional, cuya identidad deriva de su melodía, ritmo y armonía, sino que se concibe como un ensamblaje de cualidades perceptuales y conceptuales. </p>\n<p><strong>Perceptuales</strong> en tanto que debe poseer una <em>gestalt</em> reconocible a diversas escalas (cuando menos, que sea capaz de apuntar a otra versión de sí).</p>\n<p><strong>Conceptuales</strong> en tanto que su ser dentro de un evento determinado debe referir a un conjunto de ideas o procesos definen su génesis y las manera disponibles que tiene de comportarse y operar su relación con otros materiales.</p>\n<p>En el ejemplo referido anteriormente, <em>perceptualmente</em> los materiales poseen un cierto tipo de contorno y modulan parámetros relacionados perceptualmente. <em>Conceptualmente</em> se trata de la misma entidad, la primera vez percibida como un elemento dentro de un contexto amplio, la segunda percibida muy de cerca.</p>\n<p>Otro ejemplo es <a href=\"/link\">21 Nubes</a>, donde perceptualmente se puede tomar una de las Nubes de la pieza (si la concebimos como un conjunto de 21 piezas), y meterla en otro contexto,  aunque también es posible tomar el <a href=\"/link\">algoritmo de las nubes</a> para fabricar más variaciones de este elemento. En <a href=\"/link\">Videcoic One</a>, este proceso opera conceptualmente en tanto se usan las nubes en diversas secciones, en un principio se hace una Nebulosa, en otras se usan las Nubes como parte de un ambiente.</p>\n<p>Tomando el ejemplo de la nube esta concepción de las escalas nos permitiría preguntar (y musicar -reflexionar a través de la música-), sobre cómo sonaría <em>ser</em> una nube tormentosa. O en una secuencia donde se atraviesan distintos niveles de percepción podrían explorarse espacios y seres que sólo aparecen en ciertas escalas, tales como las cargas eléctricas dentro de la nube o sus gotas. </p>\n<p>Con esta concepción el tiempo del discurso musical no sólo corre en un sentido lineal, sino que nos permite atravesar por los distintos tiempos de los diversos materiales. Por ejemplo, movernos del interior de la nube tormentosa al campo, caer con la gota o el rayo, penetrar la tierra, etc.</p>\n<p>Esta capacidad de movimiento de un material abre puertas para la imaginación sonora. Para ello se requiere transformar el concepto tradicional del material musical, que es abstracto y carente de múltiples escalas, en un concepto de material musical que se conciba por medio entidades concretas (aun cuando estas sean simples metáforas), o de otras entidades complejas-compuestas (redes). Ya que ambas entidades, aunque en diversos sentidos enriquecen al material en tanto postulan un mayor número de dimensiones para su existencia.</p>\n<h2 id=\"obras-modulares\">Obras Modulares</h2>\n<p>Con <em>obras modulares</em> me refiero al conjunto de obras que he escrito con la intención expresa de que puedan interactuar unas con otras.  Por interacción me refiero a que se toquen unas sobre o junto con otras, o también unas dentro de otras. Al primer caso corresponden la interpretación de <em><a href=\"/obras/21-nubes.html\">21 Nubes</a> y <a href=\"/obras/28-palabaras.html\">28 Palabras</a></em>, o <em><a href=\"/obras/25-campanas.html\">25 Campanas</a></em> con ella misma. Al segundo caso corresponden las obras tocadas dentro de <em><a href=\"/obras/videcoic-one.html\">Videcoic One</a></em>.</p>\n<p>El que las obras modulares deban y puedan interactuar entre ellas significa que éstas deben poder transformarse y adaptarse en tiempo real. La idea es que una obra debe de poder ejercer efectos sobre la otra y viceversa. El concepto es análogo al de los elementos de un ecosistema, donde cada elementos cumple varias funciones y donde las entradas (inputs) de una elemento son las salidas (outputs) de otro, lo que resulta en un sistema en constante retroalimentación y cuyas transformaciones se derivan de este proceso (lo que también las relaciona con la idea de fractal, como en el caso del conjunto de Mandelbröt, y la teoría del caos). Esto implica una serie de disposiciones con las que las obras y los músicos deben de poder cumplir:</p>\n<ol>\n<li><p>La notación debe de poder tener suficiente indeterminación como para que las obras puedan transformarse y no ser rígidas.</p>\n</li>\n<li><p>La duración de las obras debe de estar abierta, y de los posible ser completamente manipulable, de modo que las obras puedan establecer una interacción que les permita adaptarse a la temporalidad del momento.</p>\n</li>\n<li><p>En consecuencia, la forma de las obras debe de ser capaz de admitir las transformaciones de la interacción.</p>\n</li>\n<li><p>Las apertura de las obras implica la posibilidad de extenderlas (en el momento o mediante otros recursos).</p>\n</li>\n<li><p>El sentido de la obra y el sentido del encuentro deben primar por sobre la notación.</p>\n</li>\n</ol>\n<p>Cada uno de estos puntos puede ser expresado (o explorado) de distintas maneras. Las <em>[obras numéricas]</em> plantean la posibilidad de fragmentar la pieza: tomar lo que se quiere o necesita o inspira en un momento dado, &quot;tocar la nube 7, luego la 2, luego las campanas 8 y 9, etc.&quot;. Otro ejemplo: <em>21 Nubes</em> plantea un algoritmo que podría usarse para generar más nubes. <em>Together songs erupting interplay</em> de <em>Memories of a Wedding</em> puede ser cantada por una voz sola, en lugar de dos voces y ensamble, <em>28 Palabras</em> puede ser cantada durante un lapso de 30 minutos (como en <em>Videcoic One</em>).</p>\n<p>La expresión de estos puntos, a veces está dada en la notación o en alguna instrucción, u otra veces puede estar dada por el interprete, o por un compositor utilizando la obra dentro de otra pieza (más de esto adelante).</p>\n<h3 id=\"notaci-n-de-las-obras-modulares\">Notación de las obras modulares</h3>\n<p>La notación se inspira en varias fuentes, principalmente, György Kurtàg, Christian Wolff y Julio Estrada.</p>\n<p>De Kurtàg y Wolff toma la indeterminación de las duraciones. Kurtàg es más específico en esto: en Játékok, hay dos tipos principales de duraciones, largas (notas blancas) y breves (notas negras). También hay varios tipos de calderones y comas, cada una expresando mayor o menor duración de una suspensión del movimiento. La importancia de esta indeterminación ha sido vital hasta este momento para las obras modulares: si la duración estuviera definida, y peor aun el tempo también, resultaría extremadamente difícil el poder hacer convivir a esta pieza otras. (En general podemos pensar que a mayor determinación de una obra menor capacidad de interactuar).</p>\n<p>De Wolff además se toma la noción de escribir sin clave. El músico es libre de elegir y cambiar claves (incluyendo) en cualquier momento. Esto se usa estrictamente en <em>21 Nubes</em>.  Sin embargo, como adición a este concepto, en varias obras, particularmente las vocales, la noción pentagrama es aún más ámplia y, por decirlo así, vaga: los intervalos escritos son simplemente aproximaciones, lo primordial siendo el contorno y la proporción entre los espacios (en <em>Memories of a Wedding</em> esto incluye los pentagramas para instrumentos). Esto equivale a pensar (dentro de una descripción estricta) que no sólo la clave se puede elegir y cambiar <em>a intuición</em> en cada momento, sino también la armadura (planteando la posibilidad de armaduras no tonales, así como de armaduras con dobles o triples sostenidos, o microtonos).</p>\n<p>De Estrada se toman dos elementos, la riqueza de su notación vocal, y el símbolo y el concepto de transición (la flecha). \nDe la notación vocal describimos los siguiente: </p>\n<ol>\n<li><p>Las consonantes se escriben dentro de un cuadro, especialmente cuando se quiere prologarlas durante un periodo particular de tiempo, o transformarlas. Además las consonantes se pueden superponer unas sobre otras (acordes de consonantes). </p>\n</li>\n<li><p>Las vocales también son prolongables, transformables, e independientes de las consonantes. Estrada concibe las vocales como formando un continuo, de lo &quot;opaco-oscuro&quot; a lo &quot;brillante-claro&quot;: <strong>u-&gt;o-&gt;a-&gt;e-&gt;i</strong>. Señala, también, pasos intermedios, que designa con una diéresis: <strong>u-&gt;ü-&gt;o-&gt;ö-&gt;a-&gt;ä-&gt;e-&gt;ë-&gt;i-&gt;ï</strong>.  </p>\n</li>\n<li><p>Esto último, sin embargo, no lo seguimos. En <em>28 Palabras</em> se usan superposiciones de las vocales <strong>[i-e]</strong>  (léase <strong>i</strong> sobre <strong>e</strong>)para designar lo mismo: un sonido intermedio entre <strong>i</strong> y <strong>e</strong>. Esto lo hacemos por la siguiente razón: es posible generar sonidos de caracter más &quot;desarticulado&quot; que involucran la participación de más de dos vocales en distintas proporciones, por ejemplo, <strong>[A-O-U]</strong> no es tan difícil de producir. Esto que es algo que la notación de Estrada no permite representar.</p>\n</li>\n<li><p>Además de esto agregamos vocales abiertas y cerradas, anotadas con mayúsculas y minúsculas respectivamente, y ejecutadas regulando la apertura de la cavidad bucal. </p>\n</li>\n<li><p>En términos del continuo del color vocal, se asume que no hay sólo una manera de llegar de un color a otro, sino múltiples, los siguientes pasos también son directos <strong>u-&gt;i</strong> y <strong>o-&gt;e</strong> y no requieren pasar por otra vocales. Esto muestra que el continuo del color vocal no es lineal (uni-dimensional), sino superficial, voluminal o quizá multidimensional (diagramas y concepto que sigue siendo desconocido para mi).</p>\n</li>\n<li><p>Sobre las transiciones la notación es simple: una flecha. Esta se puede aplicar en cualquier componente del sonido que admita algún tipo de transformación. El punto de inicio y término de la transición son determinados por la posición gráfica de la línea. La única excepción en el uso de la flecha es en las transiciones de altura, que utilizan la tradicional línea de glissando.</p>\n</li>\n</ol>\n<h4 id=\"otras-notaciones\">Otras notaciones</h4>\n<p>Para anotar los cambios en el continuo Ruido-Tono, se utiliza el neuma de triángulo invertido, con este resulta imposible precisar gradaciones en este continuo, pero resulta sumamente efectivo para reducir la carga cognitiva de la partitura.</p>\n<div id=\"extensibilidad-de-las-obras-modulares\"></div>\n<div id=\"conclusiones-y-condiciones-sobre-musica-modular\"></div>\n\n<!-- \n### Extensibilidad de las obras modulares \n-->\n<h2 id=\"obras-num-ricas\">Obras Numéricas</h2>\n<div id=\"variaciones-recursivas\"></div>\n\n<h3 id=\"serie-arm-nica-y-variaciones-recursivas\">Serie armónica y variaciones recursivas</h3>\n<p>La forma derivada, no se usa meramente como una estructura abstracta. Las <em>obras numéricas</em> representan seres vivientes, los números son sus ciclos: lo que para las personas son los años de vida. La forma derivada de la serie armónica es una forma acumulativa. Por ello cada una de las <em>obras númericas</em> es concebida y tratada como ciclos de variaciones. Más específicamente como variaciones en desarrollo, o como preferiría llamarlas, como variaciones recursivas. Es decir, son variaciones donde los materiales variados y/o agregados y/o desarrollados en las variaciones previas sirven como materiales de referencia para las siguientes variaciones </p>\n<p>El algoritmo que describe los procesos a seguir para realizar este tipo de variaciones se puede representar con el siguiente código (si lo escribiéramos en Javascript):</p>\n<pre><code class=\"lang-js\">const variacionesRecursivas = (totalDeVariaciones, material, variacionActual = 1) =&gt; \n    variacionActual === totalDeVariaciones\n        ? material//si ya tenemos todas las variaciones necesarias devolvemos el resultado\n        : material.concat(//si aun no tenemos las variaciones requeridas generamos la siguiente variación y la concatenamos\n            variacionesRecursivas(\n                totalDeVariaciones,\n                [`Variacion ${variacionActual}, usando ${material} mas &quot;Material Nuevo&quot; de la variación ${variacionActual},`],\n                variacionActual + 1, \n            )\n        )\n\n\nvariacionesRecursivas(6, [&quot;Material Inicial&quot;])// calculamos los procesos requeridos para 6 variaciones. Nótese que la cadena &quot;Material Inicial&quot;, estaría representando un material musical cualquiera y las cadenas &quot;Material Nuevo&quot; representarían materiales desarrollados, o agregados por las variaciones correspondientes\n</code></pre>\n<p>El siguiente link muestra al algoritmo funcionado interactivamente: <a href=\"https://codepen.io/anon/pen/NYMbPM?editors=0010\">https://codepen.io/anon/pen/NYMbPM?editors=0010</a></p>\n<p>Este proceso genera un crecimiento que se podría describir como un crecimiento espiral, debido a la acumulación de materiales y el efecto de perpetuo de retorno a materiales previos. Interesantemente <a href=\"http://www.anaphoria.com/wilsonintro.html\">Erv Wilson</a> (<a href=\"http://www.anaphoria.com/wilson.html\">archivo</a>), quizá el teórico más visionario de la afinación en el siglo XX, generó entre sus investigaciones la representación de la serie armónica del frecuencias embebida en una espiral, donde las rectas que irradian del centro de la espiral representan las octavas de las frecuencias armónicas (es decir las duplicaciones. e.g. 2, 4, 8... y 3, 6 ,12...).</p>\n<p><img src=\"/public/images/conceptos-generales/erv-wilson-harmonic-series-spiral.png\" alt=\"Erv Wilson, espiral de la serie de armónico\">\n<a href=\"http://thesonicsky.com/erv-wilson-diagrams/octaval-spiral/\">Fuente</a></p>\n<p>En este sentido la metáfora constructiva de las <strong>variaciones recursivas</strong> resuena fuertemente con la representación de la <strong>serie armónica de frecuencias</strong>, ligando el campo <strong>microcósmico</strong> del timbre, el campo <strong>macrocósmico</strong> de la forma.</p>\n<p>Recordemos, también que la serie armónica se puede definir recursivamente, pues es sólo un proceso de <code>n + 1</code> aplicado sucesivamente.  El siguiente código muestra los paralelismos entre la implementación del algoritmo de las variaciones recursivas y la del algoritmo de la serie armónica.</p>\n<pre><code class=\"lang-js\">const serieArmonica = (armonicoInicial, armonicoFinal, listaDeArmonicos = []) =&gt; \n    armonicoInicial === armonicoFinal //sólo lo necesitamos para evitar que la lista crezca al infinito\n        ? listaDeArmonicos.concat(armonicoInicial)\n        : serieArmonica(\n            armonicoInicial + 1, \n            armonicoFinal, \n            listaDeArmonicos.concat(armonicoInicial)\n        )\n</code></pre>\n"}]