[{"attributes":{},"body":"<h1 id=\"conceptos-generales\">Conceptos Generales</h1>\n<!-- \n<h2 id=\"grafos\">Grafos (redes)</h2>\n\n### Red de intervalos\n### Red de sonidos\n### Red de rítmos\n### Red de interacciones\n### Red de eventos\n\n## Cíclo Redes \n\napertura radical entendida como la posibilidad de interacción de cada una de estas piezas con otras de la misma serie (superposición, fragmentación, variación, etc.), redes (grafos) de distintos tipos, limitación radical de recursos, apertura a la interpretación y a la improvisación, no requerimiento del virutosismo técnico, cuestionamiento estético-ético de para quién se escriben estas piezas y para que situaciones se concibe su interpretación y escucha.\n -->\n<h2 id=\"escala-de-percepci-n-de-los-materiales\">Escala de percepción de los materiales</h2>\n<p>Nota: No escala en el sentido técnico musical (de una secuencia ordenada de tonos), sino escala en el sentido de una secuencia de cantidades e incluso tipos dde detalle en la observación de algo. Así como en un microscopio podemos ver algo a 10 veces o 100 veces su escala.</p>\n<p>Ver un material a distintas escalas significa preguntar: ¿qué es ese material cuando es el foco de atención, qué cuando es sólo parte del paisaje, o un mero detalle? ¿Qué tanto puede hacerse aparecer en él, qué tanto puede desaparecer? ¿Hay algún punto donde su apariencia pueda cambiar tanto que parezca irreconocible, a pesar de que lo que está ahí siempre estuvo ahí? Por ejemplo, como cuando pasamos de los átomos a las partículas subatómicas, o de estos a las moléculas o los organismos.</p>\n<p>Lo que implica esto sobre el concepto de <em>material</em> y la concepción de <em>un material</em> es interesante.  </p>\n<p>Desde el punto de vista tradicional podríamos decir esquemáticamente:\nUn material es un tema o un motivo. El tema puede variarse, adornarse, extenderse, aumentar o disminuir en duración, etc., y en todos estos casos preservar su identidad o su relación próxima con la identidad de donde deriva.  </p>\n<p>Así por ejemplo, un tema de fuga de Bach no varía más que en transposición, y en ciertos casos, en interválica, más el propósito de su ser tema (y su ser material) es ser lo más reconocible que se pueda.</p>\n<p>Otro ejemplo, un tema de sonata, está mucho más abierto a la variación e intervención con otros temas, pero igualmente su objetivo principal es ser reconocible.</p>\n<p>Con un motivo secundario, tenemos aun más libertad en cuanto a su variación y modifiación, y decimos de su razón de ser que es la de dar coherencia. Pero el interés que despierta para desarrollar es menor en función de posición en la jerarquía de materiales de la obra.</p>\n<p>En todos estos casos excepto en el último, el concepto de escala de percepción. Hablar de escala en un tema prácticamente nos remite únicamente al tiempo, aumentación o disminución rítmica del mismo, o de su posición en la textura, ¿es voz principal (<em>hauptstimme</em>) o contrapunto?</p>\n<p>Acercarnos o alejarnos de un material, bajo este concepto de material no tiene sentido pues significa la destrucción de su identidad, y puesto que su ser material esta constituido sobre la base de la identidad, destruir su identidad significa destruir su materialidad.</p>\n<p>El concepto de material que me interesa y sobre el cuál he trabajado las obras presentadas aquí, es distinto en cuanto que sí permite la variación en la escala de percepción del material. Un material que en una aparición dura 8 segundos puede crecer y transformarse en un movimiento entero sin que sea necesario agregarle nada externo (cf. <a href=\"/5to-semestre/escalas-de-percepcion\">escala de percepción en &quot;Espíritu Penetrando en Árbol&quot;</a>).</p>\n<p><a href=\"/5to-semestre#escalas-de-percepcion-del-espiritu\"><img src=\"/public/images/epa/espiritu-mvt-1.png\" alt=\"Espíritu en el movimiento 1\">\n<img src=\"/public/images/epa/espiritu-mvt-2.png\" alt=\"Espíritu en el movimiento 2\"></a></p>\n<blockquote>\n<p>El material del &quot;Espíritu&quot; en dos escalas distintas, lejos y cerca, respectivamente</p>\n</blockquote>\n<p>El material en este caso no se concibe como un tema tradicional, cuya identidad deriva de su melodía, rítmo y armonía, sino que se concibe como un ensamblaje de cualidades perceptuales y conceptuales. </p>\n<p><strong>Perceptuales</strong> en tanto que debe poseer una <em>gestalt</em> reconocible a diversas escalas (cuando menos, que sea capaz de apuntar a otra versión de sí).</p>\n<p><strong>Conceptuales</strong> en tanto que su ser dentro de un evento determinado debe referir a un conjunto de ideas o procesos definen su génesis y las manera disponibles que tiene de comportarse y operar su relación con otros materiales.</p>\n<p>En el ejemplo referido anteriormente, <em>perceptualmente</em> los materiales poseen un cierto tipo de contorno y modulan parámetros relacionados perceptualmente. <em>Conceptualmente</em> se trata de la misma entidad, la primera vez percibida como un elemento dentro de un contexto amplio, la segunda percibida muy de cerca.</p>\n<p>Otro ejemplo es <a href=\"/link\">21 Nubes</a>, donde peceptualmente se puede tomar una de las Nubes de la pieza (si la concebimos como un conjunto de 21 piezas), y meterla en otro contexto,  aunque también es posible tomar el <a href=\"/link\">algóritmo de las nubes</a> para fabricar más variaciones de este elemento. En <a href=\"/link\">Videcoic One</a>, este proceso opera conceptualmente en tanto se usan las nubes en diversas secciones, en un principio se hace una Nebulosa, en otras se usan las Nubes como parte de un ambiente.</p>\n<p>Tomando el ejemplo de la nube esta concepcion de las escalas nos permitiría preguntar (y musicar), sobre cómo sonaría <em>ser</em> una nube tormentosa. O en una secuencia donde se atraviesan distintos niveles de percepción podrían explorarse espacios y seres que sólo aparecen en ciertas escalas, tales como las cargas electricas dentro de la nube o sus gotas. </p>\n<p>Con esta concepción el tiempo del discurso musical no sólo corre en un sentido lineal, sino que nos permite atravesar por los distintos tiempos de los diversos materiales. Por ejemplo, movernos del interior de la nube tormentosa al campo, caer con la gota o el rayo, penetrar la tierra, etc.</p>\n<p>Esta capacidad de movimiento de un material abre puertas para la imaginación sonora. Para ello se requiere transformar el concepto tradicional del material musical, que es abstracto y carente de múltiples escalas, en un concepto de material musical que se conciba por medio entidades concretas (aun cuando estas sean simples metáforas), o de otras entidades complejas-compuestas (redes). Ya que ambas entidades, aunque en diversos sentidos enriquecen al material en tanto postulan un mayor número de dimensiones para su existencia.</p>\n<h2 id=\"obras-modulares\">Obras Modulares</h2>\n<div id=\"extensibilidad-de-las-obras-modulares\"></div>\n<div id=\"conclusiones-y-condiciones-sobre-musica-modular\"></div>\n\n<h3 id=\"extensibilidad-de-las-obras-modulares\">Extensibilidad de las obras modulares</h3>\n<h2 id=\"obras-num-ricas\">Obras Numéricas</h2>\n<div id=\"variaciones-recursivas\"></div>\n\n<h3 id=\"serie-arm-nica-y-variaciones-recursivas\">Serie armónica y variaciones recursivas</h3>\n<p>La forma derivada, no se usa meramente como una estructura abstracta. Las <em>obras numéricas</em> representan seres vivientes, los números son sus ciclos: lo que para las personas son los años de vida. La forma derivada de la serie armónica es una forma acumulativa. Por ello cada una de las <em>obras númericas</em> es concebida y tratada como ciclos de variaciones. Más específicamente como variaciones en desarrollo, o como preferiría llamarlas, como variaciones recursivas. Es decir, son variaciones donde los materiales variados y/o agregados y/o desarrollados en las variaciones previas sirven como materiales de referencia para las siguientes variaciones </p>\n<p>El algorítmo que describe los procesos a seguir para realizar este tipo de variaciones se puede represtar con el siguiente código (si lo escribiéramos en Javascript):</p>\n<pre><code class=\"lang-js\">const variacionesRecursivas = (totalDeVariaciones, material, variacionActual = 1) =&gt; \n    variacionActual === totalDeVariaciones\n        ? material//si ya tenemos todas las variaciones necesarias devolvemos el resultado\n        : material.concat(//si aun no tenemos las variaciones requeridas generamos la siguiente variación y la concatenamos\n            variacionesRecursivas(\n                totalDeVariaciones,\n                [`Variacion ${variacionActual}, usando ${material} mas &quot;Material Nuevo&quot; de la variación ${variacionActual},`],\n                variacionActual + 1, \n            )\n        )\n\n\nvariacionesRecursivas(6, [&quot;Material Inicial&quot;])// calculamos los procesos requeridos para 6 variaciones. Nótese que la cadena &quot;Material Inicial&quot;, estaría representando un material musical cualquiera y las cadenas &quot;Material Nuevo&quot; representarían materiales desarrollados, o agregados por las variaciones correspondientes\n</code></pre>\n<p>El siguiente link muestra al algorítmo funcionado interactivamente: <a href=\"https://codepen.io/anon/pen/NYMbPM?editors=0010\">https://codepen.io/anon/pen/NYMbPM?editors=0010</a></p>\n<p>Este proceso genera un crecimiento que se podría describir como un crecimiento espiral, debido a la acumulación de materiales y el efecto de perpetuo de retorno a materiales previos. Interesantement <a href=\"http://www.anaphoria.com/wilsonintro.html\">Erv Wilson</a> (<a href=\"http://www.anaphoria.com/wilson.html\">archivo</a>), quizá el teórico más visionario de la afinación en el siglo XX, generó entre sus investigaciónes la representación de la serie armónica del frecuencias embebida en una espiral, donde las rectas que irradían del centro de la espiral representan las octavas de las frecuencias armónicas (es decir las duplicaciones. e.g. 2, 4, 8... y 3, 6 ,12...).</p>\n<p><img src=\"/public/images/conceptos-generales/erv-wilson-harmonic-series-spiral.png\" alt=\"Erv Wilson, espiral de la serie de armónico\">\n<a href=\"http://thesonicsky.com/erv-wilson-diagrams/octaval-spiral/\">Fuente</a></p>\n<p>En este sentido la metáfora constructiva de las <strong>variaciones recursivas</strong> resuena fuertemente con la representación de la <strong>serie armónica de frecuencias</strong>, ligando el campo <strong>microcósmico</strong> del timbre, el campo <strong>macrocósmico</strong> de la forma.</p>\n<p>Recordemos, también que la serie armónica se puede definir recursivamente, pues es sólo un proceso de <code>n + 1</code> aplicado sucesivamente.  El siguiente código muestra los paralelismos entre la implementación del algorítmo de las variaciones recursivas y la del algóritmo de la serie armónica.</p>\n<pre><code class=\"lang-js\">const serieArmonica = (armonicoInicial, armonicoFinal, listaDeArmonicos = []) =&gt; \n    armonicoInicial === armonicoFinal //sólo lo necesitamos para evitar que la lista crezca al infinito\n        ? listaDeArmonicos.concat(armonicoInicial)\n        : serieArmonica(\n            armonicoInicial + 1, \n            armonicoFinal, \n            listaDeArmonicos.concat(armonicoInicial)\n        )\n</code></pre>\n"}]